Revit 2024 API
LineProperties.PatternId Property
 Id of the current Line pattern element used when drawing lines/curves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ElementId PatternId { get; }
Visual Basic
Public ReadOnly Property PatternId As ElementId
	Get
Visual C++
public:
property ElementId^ PatternId {
	ElementId^ get ();
}
See Also
LineProperties Class
Autodesk.Revit.DB Namespace